[
   {
      "id": "nonnychat",
      "name": "NonnyChat",
      "url":"https://github.com/jetweedy/nonnychat",
      "description":"Anonymous real-time chat that uses websockets to broadcast messages to browsers using the same 'room'.",
      "skills":["node", "websockets", "javascript", "vue", "htmlcss"]
   },
   {
      "id": "cv-cardgame",
      "name": "CoronaVirus: The Card Game",
      "url":"https://github.com/jetweedy/cvGame",
      "description":"A twist on games like Mafia and One Night Ultimate Werewolf, where players try to deceive each other to determine what's what and who's who.",
      "skills": ["mongo", "node", "javascript", "jquery", "htmlcss"]
   },
   {
      "id": "graphql-practice",
      "name": "GraphQL Practice: A Project Skills Database",
      "url":"https://github.com/jetweedy/graphql-practice",
      "description":"he project leverages the built-in 'notarealdb' in Node instead of using a real database, and then refers to JSON files for Projects and Skills data. Ajax requests and DOM manipulations are performed using jQuery.",
      "skills": ["graphql", "jquery", "javascript", "node", "vue"]
   },
   {
      "id": "jsGame2D",
      "name": "2D JavaScript Game",
      "url":"https://github.com/jetweedy/jsGame2D",
      "description":"A top-down 2D game demo that lets you pick one of 4 characters and move them around the map. There's not much to id, but it was a proof of concept using websockets, jquery and mongodb to build something that would update for other players in real time.",
      "skills": ["javascript", "jquery", "mongodb", "node", "htmlcss", "websockets"]
   },
   {
      "id": "twtvagrant",
      "name": "twtVagrant: Tools for Setting up a Quick and Dirty Dev Environment",
      "url":"https://github.com/jetweedy/twtVagrant",
      "description":"This is a set of tools for running virtual boxes with various programming tools installed, like Apache, PHP, Node, Python, MySQL and Mongo.",
      "skills": ["vagrant", "linux"]
   },
   {
      "id": "aheym",
      "name": "The Archives of Historical and Ethnographic Yiddish Memories",
      "url":"https://aheym.com/",
      "description":"A WordPress website for The Archives of Historical and Ethnographic Yiddish Memories, a project based out of Indiana University Bloomington.",
      "skills": ["wordpress", "php", "googlemaps", "htmlcss"]
   },
   {
      "id": "jobtortoise",
      "name": "JobTortoise: Academic Job Search Website",
      "url":"https://jonbtortoise.com/",
      "description":"No longer maintained, it still functions for demonstrating a project that used PHP, MySQL, Google Maps and some home-brewed JS/Ajax. Try searching for 'English' to get a few results.",
      "skills": ["javascript", "php", "googlemaps", "mysql", "htmlcss"]
   },
   {
      "id": "vaxseeker",
      "name": "Vaccine Appointment Scraper",
      "url":"https://github.com/jetweedy/vaxapp",
      "description":"Frustrated with the checkboxes and click-through required to discover that no appointments were available anyway, I wrote a scraper using Node and Puppeteer that would click through, look at the locations of appointments (if any), and then find the driving distance from my location using Google's API. If nearby appointments were available, it would use Twilio to text me a direct link to go snag one.",
      "skills": ["node", "puppeteer", "twilio", "googlemaps"]
   }
   ,
   {
      "id":"rednode", 
      "name":"Using Redis with Node", 
      "url":"https://github.com/jetweedy/rednode", 
      "description":"This thing is stupidly simplistic, used purely to screw around with Redis and Node. I might turn it into something useful at some point, but for now it just demonstrates setting and getting from Redis through a Node application.", 
      "skills":["node", "redis"]
   }
   ,
   {
      "id":"fhirapp",
      "name":"FHIR Mobile App Demo",
      "url":"https://github.com/jetweedy/fhirapp",
      "description":"A sample app written using JavaScript and compiled with Cordova that demonstrates working with FHIR (Fast Health Interoperability Resources) using Python.",
      "skills":["fhir", "cordova", "javascript"]
   }
   ,
   {
      "id":"pyfhir",
      "name":"Python and FHIR",
      "url":"https://github.com/jetweedy/fhirworkshop",
      "description":"A sample app demonstrating working with FHIR (Fast Health Interoperability Resources) using Python.",
      "skills":["fhir", "python"]
   }
   ,
   {
      "id":"truewindtech",
      "name":"True Wind Technology",
      "url":"https://truewindtechnology.com",
      "description":"A reasonably elaborate WordPress website with several custom plugins.",
      "skills":["php", "wordpress", "javascript"]
   }
   ,
   {
      "id":"pyPpt2PdfPng",
      "name":"Python PPT to PDF to PNG Conversion",
      "url":"https://github.com/jetweedy/python-ppt2pdf2jpg",
      "description":"A script written to facilitate the fairly redundant process of converting students Powerpoint presentations to PDFs to post on a website. The first page of each can also be converted to a PNG for east posting of a clickable thumbnail.",
      "skills":["python"]
   }
   ,
   {   
      "id":"node2pdf2zip",
      "name":"Node Puppeteer HTML to PDF to Zip",
      "url":"https://github.com/jetweedy/node-pdf-zip",
      "description":"Converting a matrix of hospitals and indicators to PDF and zipping up for download. This is basically a demo of the PDF capabilities of Puppeteer and the zipping capabilities of another library called 'zip-dir'. Designed as a step along the way for a more robust project, but was a nice stand-alone script to share in a repo.",
      "skills":["node"]

   }
   ,
   {   
      "id":"rti-challenge",
      "name":"RTI Interview Challenge",
      "url":"https://github.com/jetweedy/frontend-dev-exercises",
      "description":"A quick charting app developed as a demo for an interview challenge using Node, Vue and HighCharts.",
      "skills":["node", "vue", "javascript", "highcharts"]

   }
   ,
   {   
      "id":"webpack-practice",
      "name":"Messing Around with Webpack",
      "url":"https://github.com/jetweedy/webpack-demo",
      "description":"Getting more familiar with Webpack using their on-site resources.",
      "skills":["webpack", "javascript", "css", "node"]
   }
   ,
   {
      "id":"vuex-etc",
      "name":"Messing with Vuex",
      "url":"https://github.com/jetweedy/vuex-etc",
      "description":"Just tinkering with Vuex to get the hang of letting multiple components interact with a common store.",
      "skills":["vue","vuex"]
   }
]
